In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("Global_Superstore2.csv",encoding="latin-1")

In [3]:
data.head(4)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,31-07-2012,31-07-2012,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,05-02-2013,07-02-2013,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2013-71249,17-10-2013,18-10-2013,First Class,CR-12730,Craig Reiter,Consumer,Brisbane,Queensland,...,TEC-PH-10004664,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2013-1579342,28-01-2013,30-01-2013,First Class,KM-16375,Katherine Murray,Home Office,Berlin,Berlin,...,TEC-PH-10004583,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium

In [4]:
data.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'City', 'State', 'Country',
       'Postal Code', 'Market', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit', 'Shipping Cost', 'Order Priority'],
      dtype='object')

In [5]:
data.groupby("Country")[['Sales', 'Quantity']].sum().sort_values(ascending=False, by= 'Sales').head(5).astype('int64')

                 Sales  Quantity
Country
United States  2297200     37873
Australia       925235     10673
France          858931     10804
China           700562      7081
Germany         628840      7745

In [6]:
data.Segment.value_counts()

Segment
Consumer       26518
Corporate      15429
Home Office     9343
Name: count, dtype: int64

In [7]:
data.shape

(51290, 24)

In [8]:
data.isnull().sum()

Row ID                0
Order ID              0
Order Date            0
Ship Date             0
Ship Mode             0
Customer ID           0
Customer Name         0
Segment               0
City                  0
State                 0
Country               0
Postal Code       41296
Market                0
Region                0
Product ID            0
Category              0
Sub-Category          0
Product Name          0
Sales                 0
Quantity              0
Discount              0
Profit                0
Shipping Cost         0
Order Priority        0
dtype: int64

In [9]:
data['Postal Code'] = data['Postal Code'].fillna(0)

In [10]:
data.groupby(["City"])["Sales"].sum().sort_values(ascending=False).head(5)

City
New York City    256368.1610
Los Angeles      175851.3410
Manila           120886.9485
Seattle          119540.7420
San Francisco    112669.0920
Name: Sales, dtype: float64

In [11]:
data.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,City,State,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,32298,CA-2012-124891,31-07-2012,31-07-2012,Same Day,RH-19495,Rick Hansen,Consumer,New York City,New York,...,TEC-AC-10003033,Technology,Accessories,Plantronics CS510 - Over-the-Head monaural Wir...,2309.650,7,0.0,762.1845,933.57,Critical
1,26341,IN-2013-77878,05-02-2013,07-02-2013,Second Class,JR-16210,Justin Ritter,Corporate,Wollongong,New South Wales,...,FUR-CH-10003950,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical

In [12]:
data.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'City', 'State', 'Country',
       'Postal Code', 'Market', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit', 'Shipping Cost', 'Order Priority'],
      dtype='object')

In [16]:
data.groupby('City')[['Sales', 'Quantity']].sum().sort_values(by='Sales', ascending=False).head(5)

                     Sales  Quantity
City
New York City  256368.1610      3417
Los Angeles    175851.3410      2879
Manila         120886.9485      1661
Seattle        119540.7420      1590
San Francisco  112669.0920      1935

In [17]:
data.shape

(51290, 24)

Q1️⃣ (Date Handling + Feature Engineering)
Convert Order Date to datetime and create two new columns:
Order_Year
Order_Month
Then display the first 5 rows with:
Order Date
Order_Year
Order_Month

In [24]:
data['Order Date'] = pd.to_datetime(data['Order Date'], errors='ignore')

C:\Users\Kartik\AppData\Local\Temp\ipykernel_14784\2961333566.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  data['Order Date'] = pd.to_datetime(data['Order Date'], errors='ignore')
C:\Users\Kartik\AppData\Local\Temp\ipykernel_14784\2961333566.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data['Order Date'] = pd.to_datetime(data['Order Date'], errors='ignore')

In [26]:
data['Order Year'] = data['Order Date'].dt.year

In [28]:
data['Order Month'] = data['Order Date'].dt.month

In [29]:
data[['Order Date', 'Order Year', 'Order Month']]

      Order Date  Order Year  Order Month
0     2012-07-31        2012            7
1     2013-02-05        2013            2
2     2013-10-17        2013           10
3     2013-01-28        2013            1
4     2013-11-05        2013           11
...          ...         ...          ...
51285 2014-06-19        2014            6
51286 2014-06-20        2014            6
51287 2013-12-02        2013           12
51288 2012-02-18        2012            2
51289 2012-05-22        2012            5

[51290 rows x 3 columns]

Q2️⃣ (GroupBy + Aggregation)
Find the total Sales and total Profit for each Category.
Sort the result by total Sales in descending order.

In [32]:
data.groupby('Category')[['Sales', 'Profit']].sum().sort_values(by='Sales', ascending=False).astype('int64')

                   Sales  Profit
Category
Technology       4744557  663778
Furniture        4110874  285204
Office Supplies  3787070  518473

Q3️⃣ (Advanced Filtering + Boolean Indexing)
Find all orders where:
Region = "Central"
Discount > 0.3
Profit < 0

Display:
Order ID
Category
Sub-Category
Sales
Discount
Profit

In [51]:
data[(data['Region'] == 'Central') & (data['Discount'] > 0.3) & (data['Profit'] < 0)] [['Order ID','Category','Sub-Category','Sales','Discount','Profit']]

,Order ID,Category,Sub-Category,Sales,Discount,Profit
109,IT-2013-5208514,Furniture,Chairs,2570.8650,0.50,-2211.1650
111,ES-2012-2314672,Technology,Phones,2875.7700,0.50,-1783.0800
150,IT-2011-3675195,Office Supplies,Appliances,1983.1350,0.50,-1784.8950
156,CA-2013-108987,Furniture,Bookcases,2396.2656,0.32,-317.1528
182,IT-2011-5629016,Furniture,Tables,2228.6355,0.35,-754.4145
...,...,...,...,...,...,...
51242,CA-2012-153073,Furniture,Furnishings,17.4960,0.60,-7.4358
51256,US-2014-156356,Office Supplies,Binders,2.8960,0.80,-4.7784
51258,CA-2011-103492,Office Supplies,Binders,0.8980,0.80,-1.5715
51276,US-2014-155299,Office Supplies,Appliances,1.6240,0.80,-4.4660
51286,US-2014-102288,Office Supplies,Appliances,0.4440,0.80,-1.1100

Q4️⃣ (Top-N Analysis – IMPORTANT)
Find the top 5 products (Product Name) that generated the highest total Sales across all orders.

In [36]:
data.groupby('Product Name')['Sales'].sum().sort_values(ascending=False).head(5)

Product Name
Apple Smart Phone, Full Size             86935.7786
Cisco Smart Phone, Full Size             76441.5306
Motorola Smart Phone, Full Size          73156.3030
Nokia Smart Phone, Full Size             71904.5555
Canon imageCLASS 2200 Advanced Copier    61599.8240
Name: Sales, dtype: float64

Q5️⃣ (Business Insight – GroupBy + Multiple Aggregations)
For each Ship Mode, calculate:
Average Shipping Cost
Total Sales
Total Profit
Then sort by total Profit (descending).

In [49]:
data.groupby('Ship Mode').agg({
    'Shipping Cost': 'mean',
    'Sales':'sum',
    'Profit':'sum'
}).sort_values(by='Profit',ascending=False)

                Shipping Cost         Sales        Profit
Ship Mode
Standard Class      19.971755  7.578652e+06  890596.02120
Second Class        30.469747  2.565672e+06  292583.52708
First Class         41.053065  1.830976e+06  208104.67520
Same Day            42.937453  6.672020e+05   76173.06780

Q1️⃣ (Date Logic + Filtering)
Find all orders where:
Order Date is in 2019
Ship Date is after Order Date
Order Priority = "High"
Show:
Order ID
Order Date
Ship Date
Order Priority

In [55]:
data[(data['Order Year'] == 2014) & (data['Order Priority'] == 'High')] [['Order ID','Order Date','Ship Date','Order Priority']]

              Order ID Order Date   Ship Date Order Priority
19        TZ-2014-8190 2014-12-05  07-12-2014           High
37      US-2014-168116 2014-11-05  05-11-2014           High
38     ES-2014-2637201 2014-01-14  18-01-2014           High
41       IN-2014-37320 2014-11-11  15-11-2014           High
47       IN-2014-50473 2014-08-28  29-08-2014           High
...                ...        ...         ...            ...
51237   CA-2014-140963 2014-06-11  14-06-2014           High
51250   MX-2014-113327 2014-12-22  24-12-2014           High
51274   MX-2014-162803 2014-09-11  12-09-2014           High
51281   MX-2014-169530 2014-06-09  11-06-2014           High
51283    IN-2014-72327 2014-05-30  30-05-2014           High

[5256 rows x 4 columns]

In [56]:
data.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'City', 'State', 'Country',
       'Postal Code', 'Market', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit', 'Shipping Cost', 'Order Priority', 'Order Year',
       'Order Month'],
      dtype='object')

Q2️⃣ (GroupBy + Margin Calculation — REAL BUSINESS)
For each Category, calculate:
Total Sales
Total Profit
Profit Margin (%) → (Total Profit / Total Sales) * 100
Sort by Profit Margin descending.

In [61]:
data.groupby('Category').agg({
    'Sales':'sum',
    'Profit':'sum'
}).sort_values(by='Sales', ascending=False)

                        Sales        Profit
Category
Technology       4.744557e+06  663778.73318
Furniture        4.110874e+06  285204.72380
Office Supplies  3.787070e+06  518473.83430

Q3️⃣ (Multi-column GroupBy + Sorting)
Find total Sales and total Quantity for:
Each Region
Each Segment
Sort by total Sales (descending).

In [64]:
data.groupby(['Region','Segment'])[['Sales','Quantity']].sum().sort_values(by='Sales',ascending=False).astype('int64')

                              Sales  Quantity
Region         Segment
Central        Consumer     1479981     21655
               Corporate     850363     12516
South          Consumer      824890     13115
North          Consumer      643955      9214
Oceania        Consumer      579550      6784
South          Corporate     496014      7648
Central        Home Office   491957      7591
Southeast Asia Consumer      460752      6269
Africa         Consumer      423766      5503
North Asia     Consumer      407394      4426
EMEA           Consumer      406745      5871
North          Corporate     394226      5726
Central Asia   Consumer      369055      3935
West           Consumer      362880      6477
East           Consumer      350908      5347
Oceania        Corporate     322826      3789
South          Home Office   280002      4443
North Asia     Corporate     265747      2701
Southeast Asia Corporate     254351      3350
EMEA           Corporate     250571      3515
Central Asia   Corporate     235540      2302
West           Corporate     225855      3630
North          Home Office   209984      3081
Africa         Corporate     204938      2943
East           Corporate     200409      3358
Oceania        Home Office   197807      2265
North Asia     Home Office   175167      1724
Southeast Asia Home Office   169318      2203
Caribbean      Consumer      162349      3107
Africa         Home Office   155067      2118
EMEA           Home Office   148844      2131
Central Asia   Home Office   148230      1478
West           Home Office   136721      2159
East           Home Office   127463      1913
Caribbean      Corporate     104537      1864
               Home Office    57393      1328
Canada         Consumer       35719       454
               Corporate      19313       223
               Home Office    11895       156

Q4️⃣ (Top-N per Group — INTERVIEW CLASSIC)
For each Category, find the top 3 Sub-Categories by total Profit.

In [80]:
data.groupby(['Category','Sub-Category'])['Profit'].sum().groupby('Category').head(3)

Category         Sub-Category
Furniture        Bookcases       161924.41950
                 Chairs          140396.26750
                 Furnishings      46967.42550
Office Supplies  Appliances      141680.58940
                 Art              57953.91090
                 Binders          72449.84600
Technology       Accessories     129626.30620
                 Copiers         258567.54818
                 Machines         58867.87300
Name: Profit, dtype: float64

Q5️⃣ (Advanced Filtering + isin)
Find all orders where:
Ship Mode is either "First Class" or "Same Day"
Discount is between 0.2 and 0.5
Profit is negative
Display:
Order ID
Ship Mode
Discount
Profit

In [75]:
data[((data['Ship Mode'] == "First Class") | (data['Ship Mode'] == 'Same Day')) & (data['Discount'].between(0.2,0.5)) & (data['Profit'] < 0)] [['Order ID','Ship Mode','Discount','Profit']]

              Order ID    Ship Mode  Discount     Profit
32      CA-2012-139731     Same Day      0.30  -350.4900
37      US-2014-168116     Same Day      0.50 -3839.9904
73       IN-2014-30110  First Class      0.47  -452.8104
109    IT-2013-5208514     Same Day      0.50 -2211.1650
111    ES-2012-2314672     Same Day      0.50 -1783.0800
...                ...          ...       ...        ...
50429  IT-2011-5134922  First Class      0.50    -0.1050
50649  IT-2014-5878187  First Class      0.50    -4.9200
50960    IN-2014-19274  First Class      0.47    -4.1442
51160   US-2012-119648  First Class      0.40    -1.4760
51267    ID-2012-36725  First Class      0.45   -18.8280

[1392 rows x 4 columns]

In [73]:
data.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'City', 'State', 'Country',
       'Postal Code', 'Market', 'Region', 'Product ID', 'Category',
       'Sub-Category', 'Product Name', 'Sales', 'Quantity', 'Discount',
       'Profit', 'Shipping Cost', 'Order Priority', 'Order Year',
       'Order Month'],
      dtype='object')

Q1️⃣ (Date Handling + Time Gap Analysis)
Create a new column called Shipping_Days that shows the number of days between:
Ship Date − Order Date
Then display:
Order ID
Order Date
Ship Date
Shipping_Days

In [82]:
data['Ship Date'] = pd.to_datetime(data['Ship Date'], errors='coerce')

C:\Users\Kartik\AppData\Local\Temp\ipykernel_14784\2638476873.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  data['Ship Date'] = pd.to_datetime(data['Ship Date'], errors='coerce')

In [85]:
data['Shipping_Days'] = (data['Ship Date'] - data['Order Date'])

In [86]:
data[['Order ID','Order Date','Ship Date','Shipping_Days']]

              Order ID Order Date  Ship Date Shipping_Days
0       CA-2012-124891 2012-07-31 2012-07-31        0 days
1        IN-2013-77878 2013-02-05 2013-02-07        2 days
2        IN-2013-71249 2013-10-17 2013-10-18        1 days
3      ES-2013-1579342 2013-01-28 2013-01-30        2 days
4         SG-2013-4320 2013-11-05 2013-11-06        1 days
...                ...        ...        ...           ...
51285    IN-2014-62366 2014-06-19 2014-06-19        0 days
51286   US-2014-102288 2014-06-20 2014-06-24        4 days
51287   US-2013-155768 2013-12-02 2013-12-02        0 days
51288   MX-2012-140767 2012-02-18 2012-02-22        4 days
51289   MX-2012-134460 2012-05-22 2012-05-26        4 days

[51290 rows x 4 columns]

Q2️⃣ (GroupBy + Ranking — VERY COMMON)
Find the top 3 Regions by total Sales.
Display:
Region
Total Sales

In [90]:
data.groupby('Region')['Sales'].sum().sort_values(ascending=False).head(3).astype('int64')

Region
Central    2822302
South      1600907
North      1248165
Name: Sales, dtype: int64

Q3️⃣ (Conditional Column — Business Logic)
Create a new column called Profit_Status:
Profit > 0 → "Profitable"
Profit = 0 → "Break Even"
Profit < 0 → "Loss"

In [92]:
import numpy as np
data['Profit_Status'] = np.where(data['Profit'] > 0, 'Profitable',
                                 np.where(data['Profit'] == 0, 'Break Even',
                                          np.where(data['Profit'] < 0, 'Loss','dont know')))

In [95]:
data['Profit_Status']

0        Profitable
1              Loss
2        Profitable
3              Loss
4        Profitable
            ...
51285    Profitable
51286          Loss
51287    Profitable
51288    Profitable
51289    Profitable
Name: Profit_Status, Length: 51290, dtype: object

Q4️⃣ (Multi-condition Filtering + Sorting)
Find all orders where:
Category = "Technology"
Quantity ≥ 3
Profit < 0

Sort the result by Sales (descending) and show:
Order ID
Product Name
Quantity
Sales
Profit